uhnp/src/InformationRegisters/НастройкиРаспределенияПостатейныхРасходов/НастройкиРаспределенияПостатейныхРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиРаспределенияПостатейныхРасходов</name>
  <resources>
    <name>НастройкаУпр</name>
    <type>
      <types>DocumentRef.РаспределениеПрочихЗатрат</types>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </resources>
  <resources>
    <name>НастройкаРегл</name>
    <type>
      <types>DocumentRef.РаспределениеПрочихЗатрат</types>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </resources>
  <resources>
    <name>НастройкаНУ</name>
    <type>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/НастройкиРаспределенияПостатейныхРасходов/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если (Параметры.Свойство("СтатьяРасходов")) Тогда
		СтатьяРасходовФильтр = Параметры.СтатьяРасходов;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "СтатьяРасходов", СтатьяРасходовФильтр);
		Заголовок = Строка(СтатьяРасходовФильтр);
		РеквизитыСтатьи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтатьяРасходовФильтр,
			"ВариантРаспределенияРасходовУпр,ВариантРаспределенияРасходовРегл,ВариантРаспределенияРасходовНУ");
		Элементы.НастройкаУпр.Заголовок =	Строка(РеквизитыСтатьи.ВариантРаспределенияРасходовУпр);
		Элементы.НастройкаРегл.Заголовок =	Строка(РеквизитыСтатьи.ВариантРаспределенияРасходовРегл);
		Элементы.НастройкаНУ.Заголовок =	Строка(РеквизитыСтатьи.ВариантРаспределенияРасходовНУ);
	КонецЕсли;
	
	ЭтоФормаНастройкиСтатьи = ЗначениеЗаполнено(СтатьяРасходовФильтр);
	
	// Видимость колонок
	Элементы.СтатьяРасходов.Видимость = НЕ ЭтоФормаНастройкиСтатьи;
	Элементы.СтатьяРасходовВариантРаспределенияРасходовУпр.Видимость =	НЕ ЭтоФормаНастройкиСтатьи;
	Элементы.СтатьяРасходовВариантРаспределенияРасходовРегл.Видимость =	НЕ ЭтоФормаНастройкиСтатьи;
	Элементы.СтатьяРасходовВариантРаспределенияРасходовНУ.Видимость =	НЕ ЭтоФормаНастройкиСтатьи;
	Элементы.НастройкаУпр.ОтображатьВШапке =	ЭтоФормаНастройкиСтатьи;
	Элементы.НастройкаРегл.ОтображатьВШапке =	ЭтоФормаНастройкиСтатьи;
	Элементы.НастройкаНУ.ОтображатьВШапке =	ЭтоФормаНастройкиСтатьи;
	
	НастройкиСистемыЛокализация.УстановитьВидимостьЭлементовЛокализации(ЭтотОбъект);
	УстановитьВидимостьЭлементовФормы()
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//++ Локализация
	Если ИмяСобытия = "Запись_НаборКонстант" И Источник = "ИспользоватьРеглУчет" Тогда
		УстановитьВидимостьЭлементовФормы();
	КонецЕсли;
	//-- Локализация
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Оповестить("ИзмененыНастройкиРаспределенияПостатейныхРасходов");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	//++ Локализация
	Элементы.ЛокализацияГруппаНУ.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет");
	//-- Локализация
	
КонецПроцедуры 

#КонецОбласти
